meeting/agenda/2025/09-23.org
:PROPERTIES:
:ID:       545EB44B-773B-44BD-9416-D4D745B82C00
:END:
#+title: QT4 CG Meeting 135 Agenda 2025-09-23
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).

The [[https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09][Zoom meeting]] ID is 831 9996 6275; the passcode is 707664.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2025/08-19.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 23 September 2025.

The next meeting is planned for 30 September 2025.

** Review of open action items [0/9]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available
+ [ ] QT4CG-118-01: MK to make an incorrect type raise an error in #1906
+ [ ] QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.
+ [ ] QT4CG-128-03: NW to compare the file: module against the equivalent XProc 3.1 steps
+ [ ] QT4CG-131-01: MK to add a non-schema aware result.
+ [ ] QT4CG-131-02: MK to expand on the ~$E := <e A="p q r"…~ example
+ [ ] QT4CG-131-03: MK to change “invert” to “transpose” in the matrix example.
+ [ ] QT4CG-133-01: MK to correct the use of “Expr” in examples for get()
+ [ ] QT4CG-134-01: MK to open an issue about the error code for ~=?>~

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2124][#2124]]: 573 Functions to Construct Trees
+ PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]]: 2007 Revised design for xsl:array
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2202][#2202]]: New rules for schema-attribute and schema-element subtyping
+ PR [[https://qt4cg.org/dashboard/#pr-2200][#2200]]: 657 Allow user-defined functions in no namespace
+ PR [[https://qt4cg.org/dashboard/#pr-2176][#2176]]: 2130 encore: precedes-or-is, follows-or-is
+ PR [[https://qt4cg.org/dashboard/#pr-2175][#2175]]: 2093 Rearrange the order and grouping of functions
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2155][#2155]]: 2150 Define patterns for JNodes
+ PR [[https://qt4cg.org/dashboard/#pr-2123][#2123]]: 2051: XSLT group by cluster
+ PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]]: 2007 Revised design for xsl:array
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1011][#1011]]: fn:transform() improvements
+ Issue [[https://github.com/qt4cg/qtspecs/issues/986][#986]]: Numeric Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/407][#407]]: XSLT-specific context properties used in function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/272][#272]]: Setting parameter values in xsl:use-package

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2202: New rules for schema-attribute and schema-element subtyping
:PROPERTIES:
:CUSTOM_ID: pr-2202
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2202][#2202]].
** PR #2200: 657 Allow user-defined functions in no namespace
:PROPERTIES:
:CUSTOM_ID: pr-2200
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2200][#2200]].
** PR #2176: 2130 encore: precedes-or-is, follows-or-is
:PROPERTIES:
:CUSTOM_ID: pr-2176
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2176][#2176]].
** PR #2175: 2093 Rearrange the order and grouping of functions
:PROPERTIES:
:CUSTOM_ID: pr-2175
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2175][#2175]].
** PR #2160: 2073 data model changes for JNodes and Sequences
:PROPERTIES:
:CUSTOM_ID: pr-2160
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]].
** PR #2071: 77c deep update
:PROPERTIES:
:CUSTOM_ID: pr-2071
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]].
** PR #2155: 2150 Define patterns for JNodes
:PROPERTIES:
:CUSTOM_ID: pr-2155
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2155][#2155]].
** PR #2123: 2051: XSLT group by cluster
:PROPERTIES:
:CUSTOM_ID: pr-2123
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2123][#2123]].
** PR #2120: 2007 Revised design for xsl:array
:PROPERTIES:
:CUSTOM_ID: pr-2120
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]].
** PR #2019: 1776: XSLT template rules for maps and array
:PROPERTIES:
:CUSTOM_ID: pr-2019
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]].

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

** FYI: the path to standardization…
:PROPERTIES:
:CUSTOM_ID: h-D3B23E1A-D8D5-4665-BFFA-CA6AD0E02FEC
:END:

The W3C held a meeting about Community Groups recently. One observation
from that meeting is that the W3C does not consider Community Groups to be an
appropriate place to do standards work. They’re envisioned as incubators that
lead to the formation of regular Working Groups or migration of the work to
another standards development organization.

I pointed out that there is no W3C Activity for XML-related standardization. One
place to discuss this would be at the Technical Plenary but that’s in Kobe,
Japan this year and I don’t think anyone in this CG is planning to go. (It will
be in Dublin, Ireland next year and I will plan to go.)

More discussion, with an eye towards forming a Working Group is expected in the
following months. I have no prediction about how that will proceed.

