meeting/agenda/2025/09-23.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 135 Agenda 2025-09-23</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 135 Agenda 2025-09-23</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>
<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).
</p>

<p>
The <a href="https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09">Zoom meeting</a> ID is 831 9996 6275; the passcode is 707664.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>
<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2025/08-19.html">the previous meeting</a>.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 23 September 2025.
</p>

<p>
The next meeting is planned for 30 September 2025.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/9]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-118-01: MK to make an incorrect type raise an error in #1906</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-128-03: NW to compare the file: module against the equivalent XProc 3.1 steps</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-131-01: MK to add a non-schema aware result.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-131-02: MK to expand on the <code>$E := &lt;e A="p q r"…</code> example</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-131-03: MK to change “invert” to “transpose” in the matrix example.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-133-01: MK to correct the use of “Expr” in examples for get()</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-134-01: MK to open an issue about the error code for <code>=?&gt;</code></li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2124">#2124</a>: 573 Functions to Construct Trees</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>: 2007 Revised design for xsl:array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.2.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2202">#2202</a>: New rules for schema-attribute and schema-element subtyping</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2200">#2200</a>: 657 Allow user-defined functions in no namespace</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2176">#2176</a>: 2130 encore: precedes-or-is, follows-or-is</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2175">#2175</a>: 2093 Rearrange the order and grouping of functions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2155">#2155</a>: 2150 Define patterns for JNodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2123">#2123</a>: 2051: XSLT group by cluster</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>: 2007 Revised design for xsl:array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.3.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>: Shallow copy in XSLT with maps and arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1584">#1584</a>: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>: Functions to manage namespace usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1011">#1011</a>: fn:transform() improvements</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/986">#986</a>: Numeric Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/407">#407</a>: XSLT-specific context properties used in function items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/272">#272</a>: Setting parameter values in xsl:use-package</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2202" class="outline-3">
<h3 id="pr-2202"><span class="section-number-3">2.1.</span> PR #2202: New rules for schema-attribute and schema-element subtyping</h3>
<div class="outline-text-3" id="text-pr-2202">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2202">#2202</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2200" class="outline-3">
<h3 id="pr-2200"><span class="section-number-3">2.2.</span> PR #2200: 657 Allow user-defined functions in no namespace</h3>
<div class="outline-text-3" id="text-pr-2200">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2200">#2200</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2176" class="outline-3">
<h3 id="pr-2176"><span class="section-number-3">2.3.</span> PR #2176: 2130 encore: precedes-or-is, follows-or-is</h3>
<div class="outline-text-3" id="text-pr-2176">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2176">#2176</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2175" class="outline-3">
<h3 id="pr-2175"><span class="section-number-3">2.4.</span> PR #2175: 2093 Rearrange the order and grouping of functions</h3>
<div class="outline-text-3" id="text-pr-2175">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2175">#2175</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2160" class="outline-3">
<h3 id="pr-2160"><span class="section-number-3">2.5.</span> PR #2160: 2073 data model changes for JNodes and Sequences</h3>
<div class="outline-text-3" id="text-pr-2160">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2071" class="outline-3">
<h3 id="pr-2071"><span class="section-number-3">2.6.</span> PR #2071: 77c deep update</h3>
<div class="outline-text-3" id="text-pr-2071">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2155" class="outline-3">
<h3 id="pr-2155"><span class="section-number-3">2.7.</span> PR #2155: 2150 Define patterns for JNodes</h3>
<div class="outline-text-3" id="text-pr-2155">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2155">#2155</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2123" class="outline-3">
<h3 id="pr-2123"><span class="section-number-3">2.8.</span> PR #2123: 2051: XSLT group by cluster</h3>
<div class="outline-text-3" id="text-pr-2123">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2123">#2123</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2120" class="outline-3">
<h3 id="pr-2120"><span class="section-number-3">2.9.</span> PR #2120: 2007 Revised design for xsl:array</h3>
<div class="outline-text-3" id="text-pr-2120">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2019" class="outline-3">
<h3 id="pr-2019"><span class="section-number-3">2.10.</span> PR #2019: 1776: XSLT template rules for maps and array</h3>
<div class="outline-text-3" id="text-pr-2019">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
<div id="outline-container-h-D3B23E1A-D8D5-4665-BFFA-CA6AD0E02FEC" class="outline-3">
<h3 id="h-D3B23E1A-D8D5-4665-BFFA-CA6AD0E02FEC"><span class="section-number-3">3.1.</span> FYI: the path to standardization…</h3>
<div class="outline-text-3" id="text-h-D3B23E1A-D8D5-4665-BFFA-CA6AD0E02FEC">
<p>
The W3C held a meeting about Community Groups recently. One observation
from that meeting is that the W3C does not consider Community Groups to be an
appropriate place to do standards work. They’re envisioned as incubators that
lead to the formation of regular Working Groups or migration of the work to
another standards development organization.
</p>

<p>
I pointed out that there is no W3C Activity for XML-related standardization. One
place to discuss this would be at the Technical Plenary but that’s in Kobe,
Japan this year and I don’t think anyone in this CG is planning to go. (It will
be in Dublin, Ireland next year and I will plan to go.)
</p>

<p>
More discussion, with an eye towards forming a Working Group is expected in the
following months. I have no prediction about how that will proceed.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
